mvp_03_uml_to_py/combined_mermaid.md
```mermaid
classDiagram
    class _MyString {
        <<interface>>
        +__init__(line str) void
        +line str
        -__line str
        +switch_cases SwitchCase
        +justifies JustifyString
        +is_methods IsString
    }
    
    class _SwitchCases {
        <<interface>>
        +__init__(line str)
        -__line str
        +upper() str
        +lower() str
        +title() str
    }
    
    class _IsString {
        <<interface>>
        +__init__(line str)
        -__line str
        +isupper() bool
        +islower() bool
        +istitle() bool
    }
    
    class _JustifyString {
        <<interface>>
        +__init__(line str)
        -__line str
        +center(width int, fill_char str) str
        +left_just(width int, fill_char str) str
        +right_just(width int, fill_char str) str
    }
    
    class _JustifyString1 {
        <<interface>>
        -__line str
        +center(width int, fill_char str) str
        +left_just(width int, fill_char str) str
        +right_just(width int, fill_char str) str
    }
    
    _MyString *-- _SwitchCases : composition
    _MyString *-- _IsString : composition
    _MyString *-- _JustifyString : composition
```
